{"Upper Primary": {"Energy": {"Respiration": {"Anaerobic Respiration": {"Anaerobic Respiration occurs when there is not enough oxygen available.": {}, "Glucose is only partially broken down and lactic acid is produced.": {}, "A lot less energy is produced and most energy (About 70%) is lost in the form of heat.": {}, "When Anaerobic Respiration occurs in yeast, it is called fermentation.": {}, "Water + Carbon Dioxide ----(Sunlight + Chlorophyll)---> Sugars (Glucose) + Oxygen": {}, "Empty Cell": {}}}, "Energy forms and uses": {"Photosynthesis": {"Plants are the only organisms that create their own food. They create their own food through a process called Photosynthesis.": {}, "During photosynthesis, plants convert light energy to chemical energy, and get sugars and oxygen in exchange.": {}, "Carbon Dioxide enters the leaves through openings known as the stomata during the day. The stomata is found mostly on the underside of the leaves. During gaseous exchange, the stomata will open and close, allowing gases to enter and leave the plant. A chemical reaction will occur when the carbon dioxide combines with the stored energy (sunlight) to produce sugars.": {}, "Empty Cell": {}}, "Storage of energy (Plants)": {"The sugars made by the plant during photosynthesis are stored as starch.": {}, "The sugars are stored in different places, such as roots, stems, leaves and fruits in plants that can bear fruits.": {}, "Empty Cell": {}}}, "Food Chains": {"Producers": {"Plants are also called producers in a food chain as they help produce food for animals further in the food chain.": {}, "Plants have unlimited energy as they get their energy from the sun as light.": {}, "Empty Cell": {}}, "Herbivores/Primary Consumers": {"Herbivores are plant eaters.": {}, "They have the ability to digest the plants they eat and release the energy stores in the plant cells for their own use. ": {}, "Empty Cell": {}}, "Carnivores/Secondary Consumers": {"Carnivores are meat eaters": {}, "Predators and scavengers fall into this group. They eat animals that eat plants, also known as Herbivores or Carnivores.": {}, "Empty Cell": {}}, "Omnivores": {"Omnivores are animals that eat both plants and animals.": {}, "For example, some examples of omnivores are humans, bears, turtles, monkeys.": {}, "Empty Cell": {}}, "Decomposers": {"Decomposers are animals that feed on dead plants or animals, which break down the dead plants and animals into simple substances that would be returned to the environment": {}, "Made up mostly of bacteria and fungi.": {}, "Empty Cell": {}}, "Apex Predator": {"Apex Predators are predators that are at the end of the food chain, and eat most organisms": {}, "An Example of an Apex Predator is humans.": {}, "Empty Cell": {}}, "Energy": {"Energy is the ability to do work.": {}, "All of the energy used by humans on earth comes either directly or indirectly from the sun.": {}, "We use the energy directly from the sun, when we use things like solar panels to capture the light energy from the sun.": {}, "We use the energy indirectly from the sun, when we eat plants whom get their energy and food from the sun by photosynthesis.": {}, "Empty Cell": {}}}, "Types of energy": {"Primary": {"Natural Resources": {}, "Empty Cell": {}}, "Secondary": {"Usable forms of energy which primary energy may be converted into electricity and petrol": {}, "Empty Cell": {}}}}, "Cycles": {"Reproduction in Plants": {"Flowers": {"Generally, a a flower acts as a medium to enable the male and female reproductive cells to fuse in order to produce seeds. The process begins with pollination followed by fertilisation and continues with the formation and dispersal of the seeds": {}, "Some flowers grow in clusters while others grow singly. All flowers, however, have a protected ovary to contain the seeds and stamens to produce pollen.Flowers often hove showy petals and produce sweet nectar to attract insects. ": {}, "After the flower opens, the sepals can often be seen behind the petals. The sepals protect and sometimes support the corolla (which refers to a group of petals). The petals send signals to insects that there is nectar in the flower.": {}, "Nectar is secreted at the base of the petals on the inside of the flower. The nectar is used to lure insects to the flower and the insects get a dusting of pollen as they crawl into the flower to reach for the nectar. Then the insects fly off to other flowers, taking the pollen from the first flower with them. ": {}, "Insects carry the pollen from flower to flower to pollinate the flowers which eventually results in fertilisation of the reproductive cells between male and female flowers": {}, "Empty Cell": {}}, "Reproductive parts of a flower": {"The flower holds the reproductive parts-stamen (male reproductive part) and pistil (female reproductive part). The stamen produces pollen grains (male reproductive cells). The pistil is in the centre of the flower. The unfertilised seeds (also known as ovules) are located at the bottom of the pistil.": {}, "The pistil makes up the female reproductive part of a flower Seeds are produced here. A flower may have one or more pistils.The parts of a pistil include the: ": {}, "Stigma - a small, sticky pad where the pollen grains stick to a tube where the pollen grains grow down towards the ovary. ": {}, "Style - a tube where the pollen grains grow down towards the ovary. ": {}, "Ovary - contains the embryo seeds (or ovules) which grow into seeds once fertilised.": {}, "Generally the will of the ovary protects the developing seeds. When the seeds are mature, they are often found in some sort of encasement. The encasement could be o pod, a fruit or a berry. These seeds are usually scattered far away from the parent plant by the various forms of seed dispersal.": {}, "Stamen The stamen is the male reproductive organ of a flower It is made up of two parts ": {}, "Filament - a slender stem that supports the anther  ": {}, "Anther - contains pollen a where pollen grains are formed, it splits to release the pollen during pollination": {}, "The anthers open when the pollen is mature, releasing a fine, powdery dust. Some types of pollen are only ripe for few days while some lost much longer. We often think of pollen as yellow powder, but it can be white, orange, brown, purple or black, and it comes in many different shapes and sizes. These pollen grains are easily picked up by an insect or a bird. A flower may receive pollen from many different kinds of plants. However, only pollen grains from the same kind of plant will begin to grow.": {}, "Empty Cell": {}}, "Pollination": {" Pollination is the transfer of pollen from anther of a flower to the stigma of the some flower or of another flower. There one few flowers that con self pollinate. Pollination has to happen before fertilisation con take place.": {}, "Many plants are pollinated by animals. Plants may attract pollinators by having colourful flowers, fragrances and sugary nectar. ": {}, "As the pollinators climb around flower searching for and drinking the nectar, their bodies are covered with pollen As a pollinator moves from one flower to the next, pollen falls from the pollinators body as it moves, thus pollination the flowers. Bees, ladybirds, moths, butterflies, birds, bots, giraffes and beetles are some animals that pollinate plants. We con also pollinate plants as we brush against flowers ond inadvertently collect and transfer pollen": {}, "In some plants, pollen falls from the anther to the stigma on the some flower, thus eliminating the need for a pollinator. This process is called self-pollination. Self-pollination is beneficial for plants that are isolated from their own kind. Self-pollination is usually undesirable, because it reduces the chances of getting new combinations of genes": {}, "In wind pollination, pollen is distributed by wind among the flowers. These species of plants do not develop scented flowers nor do they produce nectar. Male and female reproductive organs are generally found in separate flowers, the mole flowers having a number of long filaments terminating in exposed stamens, and the female flowers having long, feather-like stigma. Pollen from wind pollinated flowers tends to be smaller and lighter than pollen from insect pollinated flowers. These pollen have very low nutritional value to insects": {}, "Empty Cell": {}}, "Fertilisation": {"Fertilisation is the fusion of sperm and egg. This takes place in the ovule. For fertilisation to take place, pollen of the right type must join up with the ovules. The pollen that falls on the stigma germinates and the pollen tube grows out and grows through the style toward the ovule.The ovules are  contain the DNA of the female parent plant, but cannot develop into complete seeds until they have had the DNA of the male parent plant  added. ": {}, "Fruits and seeds result from sexual reproduction in flowering plants. The is an ovary that has developed and matured A fruit usually contains seeds.Fruits are adaptations for dispersing seeds while seeds function in the dispersal and propagation of plants. Some fruits are fleshy with parts that are edible Some fruits are dry while others are heavy and are designed to be dispersed by falling and rolling away from the parent plant. Some have wings or fluffy tak to enable them to be carried away by the wind to be dispersed.": {}, "The DNA is contained in chromosomes and when the ovules or stamens on being made, the DNA of the plant divides in half, and each parent puts o set its own chromosomes into its half of the reproductive element (the the female parent and the pollen for the male parent) ovules do When the ovules are fertilised, the two sets of chromosomes join together to make the double set which a new plant needs The fact that the same genes are passed on to each succeeding generation what makes the new plant similar to its parents; for example, daisies produce daisies in the next generation and do not have the DNA to produce After fertilization, the ovule becomes a seed and the ovary becomes a fruit.": {}, "There are basically two types of fruits Fleshy fruits and Dry fruits": {}, "Seeds develop from the ovules in the female plant, after they have been fertilised by the pollen from the male parent plant Seeds are not visible unless the more mature and ripe. Unripe seeds are soft, White or green, and enclosed in a hord green fleshy fruit (pod). When seeds are ripe and mature, they change colour": {}, "The structure of a seed consists of: ": {}, "Cotyledons - Food storage organs that function as first seed leaves": {}, "Plumile - Embryo shoot": {}, "Epicotyl - Stem above cotyledon": {}, "Hypocotyl - Stem below attachment point": {}, "Radicle - Stem tip developing into a root": {}, "A seed protects and nourishes the embryo in it Seeds may differ in appearance bond Structures. However, all seeds contain a plant embryo and store food in a protective coot. Although it takes more energy for a plant to produce seeds than spores, seeds have on advantage over spores in their ability to remain dormant.": {}, "Empty Cell": {}}, "Seed dispersal": {"Seed dispersal is the scattering of offspring away from each other and from the parent plant.": {}, "There are two main advantages of seed dispersal, which are, Improved chances of success by reducing competition and overcrowding and enables colonisation of new suitable habitats increased chance of species survival.": {}, "Fruits which are dispersed by water have fruits and seeds which ore usually fibrous and con foot on water. For example, buoyant fruits, eg sedge and coconut and buoyant seeds, e.g. water lily pong pong, nipah and lotus.": {}, "Seed dispersed by animal are sticky or have little hooks on them. These burrs stick to the fur of passing animals and are carried away to grow in new place, eg burdock, love grass and mimosa": {}, "Seed dispersal by splitting or explosive mechanism There are two types of splitting action for fruits which are dispersed in this manner. For example explosive oration, eg baham and rubber and fruits which split open but without an explosive action eg. African tulip and kapok.": {}, "Seed dispersal by wind Fruits which are dispersed by wind have characteristics like wing-like structure, eg. angsana, shorea, dandelion and sycamore, lightweight seeds which enable them to be transported by the wind, e.g orchid and grass, fine hairs to enable them to float in air, e.g lalang": {}, "Fleshy and juicy fruits which act as a food source The fruits are fragrant, sweet and attractively coloured. The seeds pass through the animal digestive tracts or are carried together with the fruit to a new location. Eg, tomato, rambutan, guava, durian, apple and mango. Other plants produce nuts - seeds with hard tells. These seeds roll and bounce, and are gathered by small animals like squirrels": {}, "Empty Cell": {}}, "Germination": {"Seeds must be placed in proper environmental conditions-optimal moisture, proper temperature, and ample oxygen for them to germinate. Only when these conditions are met would seed germination time place.": {}, " Deloying of germination often assures the survival of the plant. For example, if the seeds thot mature in autumn were to sprout immediately the young plants could be killed by cold weather. If all of a plant's seeds were to sprout at once and all of the new seeds died before producing seeds, the species could become extinct.": {}, "However, for some species of plants, many of their seeds will not germinate even when exposed to conditions ideal for germination. Such seeds exhibit dormancy. In order to germinate and break dormancy, a seed has to absorb quite a bit of water. In nature, seeds absorb this water from the soil. ": {}, "Environmental factors such as water, Oxygen, and temperature trigger seed germination. Most seeds are very dry and must absorb water to germinate. Water softens the seed coat and activates enzymes that convert starch in the cotyledon or endosperm Into simple sugars, which provide energy for the embryo to grow.": {}, "The first visible sign of seed germination is the emergence of the radicle root) soon after the radicle breaks the seed coat, the shoot begins to grow.The embryonic leaves unfold. synthesise chlorophyll and begin to carry out photosynthesis. After their stored nutrients are used up, the shrunken cotyledons fall off": {}, "As the embryo begins to grow, the softened seed coat cracks open, ennobling the oxygen needed for cellular respiration to reach the embryo. Seeds will only germinate if the temperature is within a certain range. Some seeds germinate only after being exposed to extreme conditions, after freezing or passing through a digestive system that breaks down the seed coats": {}, "Empty Cell": {}}}, "Reproduction in Animals": {"How living things reproduce": {"There are a few ways in which organisms can reproduce. In uncertain and dangerous environments, organisms will produce many offspring. The more offspring there are, the higher the chances of survival of their species. The life expectancy of these offspring is short as most of these offspring will die before they become adults or before they are ready to reproduce. The parents do not look after their young. The young mature rapidly and reproduce at an early age. They are thus able to reproduce so many offspring as quickly as possible.Animals with many offspring may devote fewer resources to each individual offspring, for these types of animals it is common for a large number of offspring to die soon after birth, but there are sufficient numbers that survive to maintain the population of their species.": {}, "In a stable environment, with a predictable supply of resources and few dangers, organisms produce few offspring. These offspring are cared for by their parents. They are well-developed and tend to live longer. They mature slowly and reproduce at a late age.": {}, "Empty Cell": {}}, "Fertilisation": {"Fertilisation is the union of sex cells (sperm and egg) to form a new organism, a zygote (fertilised ovum), which develops into an embryo.Depending on the species of the animal, fertilisation can occur within the body of the female in internal fertilisation or outside the body of the animal in external fertilisation.": {}, "The process of internal fertilisation begins when the male deposits its sperm directly into the female's body. In most mammals and some reptiles, the embryo develops inside the female's body after fertilisation.Most land animals like insects, some reptiles and mammals reproduce by internal fertilisation. However, in birds and most other reptiles, the embryo develops outside the female's body. The female usually lays an egg where the embryo develops within. The egg is protected by a shell that contains material which nourishes the growing embryo and enables it to develop fully.": {}, "During external fertilisation, the male and female reproductive cells unite outside the female's body. This process usually takes place in the water. The male releases its sperms into the water at about the same time that the female release her eggs. Some of the sperms will come into contact with some of the eggs and fertilise them. Most of the aquatic invertebrates and some vertebrates, including the majority of fish and amphibians, reproduce by external fertilisation. The eggs of most fish are fertilised externally.": {}, "Empty Cell": {}}, "Reproduction  ": {"Reproduction is a fundamental feature of all life. It is a biological process by which new individual organisms are produced. The reproductive process always includes the transfer of hereditary materials from the parent to its offspring so that they too can reproduce. There are two basic types of reproduction--asexual reproduction and sexual reproduction": {}, "Asexual reproduction is the production of new individuals without the union of sex cells sperm and egg). The continuity of life is assured by mitosis. A cell replicates its DNA and becomes twa new daughter cells, each having identical characteristics and carrying on the same life functions as the parent cell.Asexual reproduction is common among simple organisms such as amoeba and single-celled organisms However, it is not limited to single celled organisms. Most plants have the ability to reproduce asexually. Examples of asexual reproduction in plants and single-celled organisms include budding and binary fission respectively": {}, "exual reproduction is the production of offspring through the union of male (sperm) ond female (egg) sex cells. In this process, two individuals are required - a male and a female.": {}, "Empty Cell": {}}, "Reproductive parts  ": {"Male reproductive system The male reproductive system contains two main parts the penis and the testes. In a male reproductive system, there are two egg-shaped testes The testes produce the sperm The testes lie between the testes between the thighs in a pair of pouch-like bogs called Scrotum or scrotal sac forts of the reproductive Parts of the male reproductive system The scrotum or scrotal sacs, which are found outside the body. Therefore, they have a lower temperature than that of the body. This is necessary for the sperms to develop properly. Sperms are only able to develop at temperature that is lower than that of its body temperature.The penis consists of tissues that have numerous spaces which can be filled with blood. ": {}, "The female reproductive system consists of the ovary the oviduct, the uterus, the cervix and the vagina.The ovary produces eggs. When the eggs are mature, they are released from the ovaries. The uterus, also known as the womb, is where the foetus develops during pregnancy. The ovaries are connected to the uterus via the oviduct or fallopian tubes, At certain intervals, the ovaries release an ovum, which posses through the fallopian tube into the uterus, where the egg is usually fertilised in the oviduct. The cervix is located at the lower end of the uterus. During birth, it enlarges to allow the foetus to pass through the vagina.": {}, "Empty Cell": {}}, "Reproduction in Mammals ": {"Life for an offspring begins when the sperm cell reaches the egg cell during the process of fertilisation. Egg cells mature in the ovary and ore then released into the abdominal cavity called the oviduct. It is within the oviduct that fertilisation takes place. Some mammals, such as dogs, cats and rabbits release several eggs at once, resulting in multiple births Others such as horses, cows and elephants.": {}, "Empty Cell": {}}, "Gestation": {"Gestation is the period of time during which the foetus develop inside the female, During this time, the foetus receives all of its nutrition and oxygenated blood from the mother filtered through the placenta, which is attached to the foetus abdomen via on umbilical cord.": {}, "Gestation, also known as pregnancy in humans is divided into three periods known as trimesters. Each trimester is 3 months long During these periods, the drain of nutrients can be quite taxing on the mother, who is required to ingest significantly higher levels of calories. In addition, certain vitamins and other nutrients are required in greater quantities than normal often requiring higher consumption of food.The length of gestation for humans range between 37 and 42 weeks.The length of gestation varies greatly from species to species. For dog, their gestation period is nine weeks regardless of breed, 5660 weeks in giraffes and 16 days in hamsters": {}, "Empty Cell": {}}, "Birth": {"When gestation is completed, the foetus that is growing in the mother's womb born alive, having moved through the birth canal. The foetus is ready to breathe air without the umbilical cord for the first time and receive food through its digestive system. The umbilical cord connecting the foetus to the placenta will be cut completely, freeing the newborn from the mother. The placenta will then be expelled by the womb, so that the womb can heal and prepare for another pregnancy. In animals, the umbilical cord is bitten off and eaten by the mother to nourish her and to recycle the proteins. ": {}, "Some mammals such as mice, cats and rabbits are born blind and helpless. Mammals with longer gestation periods, such as horses, elephants and cattle are able to stand, wolk and even run almost immediately after birth.": {}, "Empty Cell": {}}, "Heredity": {"Heredity is the genetic transmission of characteristic traits from the parent offspring by means of genes in the chromosomes of the cells. This transmission of characteristics takes place either through sexual or asexual reproduction.": {}, " Genes determine a person's appearance-height hair colour, skin colour and eye colour. Mental abilities and natural talents are also affected by heredity as is the susceptibility to acquire certain diseases. The gene is defined as the unit of inheritance. Chemically speaking, each gene is the blueprint for a specific type of protein in the body. Proteins are important because they perform many functions in the cells and the human body.": {}, "Proteins are made of smaller units called amino acids.There are twenty types of amino acids the human body. Different combinations and numbers of these amino acids make different types of proteins. That means one protein may only have four amino acids while another has twenty; two proteins may both have twenty amino acids but are in a different order in each protein. Each amino acid is made up of three nucleotide bases found in DNA, also known as deoxyribonucleic acid. Each DNA molecule consists of two parallel strands twisted around each other to form a double helix. A helix is a coiled structure like a corkscrew or spring. A molecule of DNA is wrapped around proteins to form a single chromatin thread. During cell division, chromatin threads coil tightly into structures called chromosomes inside the cell nucleus.": {}, "Chromosomes, genes and DNA A gene is a small segment of DNA that contains information that is used to make a single protein. Each protein is responsible for determining a particular characteristic of an organism. Coiled DNA molecules are called chromatin threads or chromosomes, which are found inside the nucleus of a cell. Within the DNA molecule, genes exist that specify a certain, single characteristic For example, there is a gene for height, a gene for weight, and a gene for eye colour, etc.": {}, "Variations of the gene relating to the same trait are called alleles. Individuals carry two genes for each trait, one from the mother's egg and one from the father's sperm. When an individual reproduces, the two genes split up and end up in separate reproductive cells. One of these two genes is dominant over the other. The dominant allele will mask the other, called the recessive allele. For example, if the father gives a tall allele of the height gene, and the other gives a short allele, the offspring will be tall. This is because tall is dominant and short is recessive.": {}, "Human beings have cells with 46 chromosomes - 2 sex chromosomes (XX or XY) and 22 pairs of non-sex chromosomes. In the process of reproductive cell division, by which ova and sperms are produced, the chromosomes are divided so that each mature reproductive cell contains half (23) of the original number of chromosomes, or one chromosome of each pair. Thus, when the ovum and the sperm fuse on fertilisation, the fertilised egg receives one set of chromosomes from each parent and the original number of chromosomes (46) is restored.": {}, "The characteristics that an organism inherits from its parents are called traits:": {}, "Traits are genetically determined. In humans, traits include things such as the colour of a person's hair, skin and eyes, the blood group, the shape of nose and lips, and the tendency to be short-sighted or to become bald. Certain human traits can be modified by the influence of the environment, while others cannot:": {}, "Blood type is an inherited trait that will not change, whereas the tendency to be tall or short con be modified by what you eat, how fast you grow, illnesses and other factors": {}, "Sometimes, it is possible to show a trait which neither of the parents exhibits This means that these genes are passed on from someone else in your family. It could be your grandparents for example, who have that trait.": {}, "Sometimes such traits can even come from great-grandparents. This is because of recessive genes. Recessive genes are genes whose trait is not displayed or expressed. The dominant gene is the gene whose trait is displayed or expressed over the unexpressed or recessive gene.": {}, "Empty Cell": {}}}, "Water": {"States of water": {"The states of water are solid, liquid and gas. Water exists in the liquid state at room temperature. If we cool it down, it changes into ice. If we heat it, it changes into steam.": {}, "When heat is applied to ice, its change in state typically goes from solid to liquid to gas. When water vapour is cooled, its change in state typically goes from gas to liquid to solid": {}, "Empty Cell": {}}, "Heat gain": {"When water reaches the temperature at which a change in state occurs, the temperature will remain the same until all the energy is used to change its state": {}, "When ice is heated, its temperature rises until it reaches its melting point (0°C).Then the ice will stay at that temperature until all the ice has melted. Heat energy is used to melt the ice and not to raise the temperature. After the ice has melted, the temperature of the water will continue to rise as more heat is applied. Thus, any additional heat added to the ice will not raise the temperature until all of the ice has melted. The additional energy merely supplies enough energy to cause the ice to melt.": {}, "When water is heated, its temperature rises until it reaches its boiling point (100°C). The temperature will then remain at that point until all of the liquid is boiled away into steam. The temperature of the steam can then be increased.": {}, "Empty Cell": {}}, "Heat loss": {"Likewise, when water vapour is cooled, its temperature will drop until it reaches the condensation point. ": {}, "Any additional cooling or heat loss will not lower the temperature until all of the gas has condensed into liquid. The temperature of water will continue to drop as more cooling is applied. Once water reaches the freezing point (0°C), the temperature will remain at that point until all of the liquid has solidified and the temperature of ice can then continue to decrease.": {}, "Evaporation is a process where liquid changes into gas. Unlike boiling which occurs at a fixed boiling point of the substance, evaporation takes place at any temperature. This occurs when the atoms or molecules in a sufficient energy to enter the gaseous state. This process is the opposite of condensation. ": {}, "However, evaporation proceeds more quickly at a higher temperature. Since only a small proportion of the molecules are located near the surface and are moving in the proper direction to escape at any given instant, the rate of evaporation is limited. Also, as the faster-moving molecules escape, the remaining molecules have lower average kinetic energy, and the temperature of the liquid thus decreases. This phenomenon is called evaporative cooling.": {}, "The rate of evaporation is dependent on the following factors:": {}, "Wind": {}, "Temperature": {}, "Surface area ": {}, "Humidity": {}, "Empty Cell": {}}, "Water cycle": {"It is a natural cycle. The water cycle is also called the hydrologic cycle. It is the continuous movement of water from the Earth's surface into the air and back to the Earth's surface again. Water undergoes several changes in state through different processes in the water cycle.": {}, "Water can be found in all three states during the water cycle:": {}, "solid (ice, snow, ice caps)": {}, "liquid (lakes, rivers, seas, oceans)": {}, "gas (water vapour)": {}, "The heat from the Sun is the driving force for the water cycle.": {}, "The water cycle ensures the continuous movement of water around the Earth. It ensures that the amount of water on the Earth remains the same over the years.": {}, "NaN": {}, "Empty Cell": {}}, "Usage": {"Water is essential to all living things. Plants derive some of their nutrients from minerals in the soil. These minerals have to be dissolved in water in order to be absorbed by the plants. Water is taken into the human body by consuming plants, meat and beverages.": {}, "Humans can go for a month without eating but will die in three to five days without water because our bodies are made up of about 70 percent water. The body uses water to maintain its temperature, breathe, digest food and lubricate moving joints.": {}, "A wide variety of animal life, in or around freshwater ecosystems, like aquatic birds, amphibians, mammals and a wide variety of fish depend on water for survival.": {}, "Some of the most important uses of water are at our homes. It is used for indoor and outdoor purposes. All the things you do at home drinking, preparing food, bathing, washing clothes and dishes, brushing your teeth, watering the yard and garden and even washing the dog make use of water.": {}, "Use of water in commercial places is important because without it, we would not have any restaurants pizza houses, coffee shops, food centres and other eateries. Along with the eateries, water is commercially supplied to motels, offices, prisons military Institutions and fish hatcheries": {}, "The industries that produce metals, wood and paper products, chemicals, gasoline, oils and probably every manufactured product use water during some parts of the production process.": {}, "Throughout the world, irrigation (water for agriculture or growing crops) is probably the most important use of water. Almost 60 per cent of all the world's freshwater withdrawals go towards irrigation uses. Large-scale farming will not be able to provide food for the world's large population without the irrigation of crop fields by water from rivers, lakes, reservoirs and wells. Without irrigation, crops could never grow.": {}, "Water is needed to raise livestock such as cows, chickens, horses and rabbits. Here, water is needed for watering, feeding, dairy operations and other forms of  needs. This includes water for raising cows, chickens, horses, rabbits, fish and other animals. Water is also used in the production of meat, poultry eggs and milk": {}, " Production of electrical power results in one of the largest uses of water worldwide. Water for thermoelectric power is used in generating electricity with steam driven turbine generators.": {}, "Like other industries, mining corporations need water to make bare rocks give up valuable minerals. Water is used for the extraction of minerals that may be in the form of solids such as coal, iron, sand and gravel: liquids such as crude petroleum and gases such as natural gas. Water is needed to carry out activities such as quarrying, milling (crushing, screening, washing and flotation of mined materials, re-injecting extracted water for secondary oil recovery and other operations associated with mining activities.": {}, "Hydroelectric energy is produced by the force of falling water. The capacity to produce this energy is dependent on both the available flow and the height from which the water falls. As water builds up behind a high dam, it accumulates potential energy.": {}, "The gained potential energy is transformed into mechanical energy when the water rushes down the sluice and strikes the rotary blades of the turbine.": {}, "NaN": {}}}}, "Interactions": {"Forces": {"Balanced and unbalanced forces": {"Forces occur in pairs and can either be balanced or unbalanced. ": {}, "Unlike balanced forces, unbalanced forces always cause a change in the direction of motion. They are not equal and are unbalanced. When two unbalanced forces are exerted in opposite directions, their combined force is equal to the difference between the two forces and is exerted in the direction of the larger force.": {}, "Balanced forces do not cause a change in motion. They are equal in strength and opposite in direction.": {}, "Empty Cell": {}}, "Effects of forces": {"A force cannot be seen but its effects can be seen or felt. ": {}, "There are two ways we can experience the effects of a force:": {}, "contact forces": {}, "indirect contact forces/forces resulting from action-at-a-distance": {}, "Contact forces are types of forces in which the two Interacting objects ore physically in contact each other. ": {}, "Some examples of contact forces are: ": {}, "frictional force": {}, "applied force": {}, "when a stationary ball is being kicked, it starts to roll": {}, "when a hand presses on a ball of plasticine, the shape of the plasticine is being changed": {}, "Indirect contact forces are types of forces in which the two interacting objects are not in physical contact with each other, out are able to exert a push or a pull despite a physical separation. Some examples of indirect forces are gravitational force, magnetic force and electric force. ": {}, "Sometimes two forces act on an object. The sum of these forces is called the net force. If the net forces are balanced, there is no change in the motion of the object, as the two forces are equal in size and their direction of motion are opposite each other. If the forces are unbalanced, then the forces change the motion or speed of the object": {}, "Empty Cell": {}}, "Drawing force diagrams": {"We can draw diagrams to describe a force. In doing so, we can provide some details of a force. You can show a force on a drawing by using a arrow": {}, "We use arrows to show whether a force is a push or a  pull": {}, "We use arrows to show the size of a force. A longer arrow indicates a bigger force while a shorter arrow indicates a smaller force": {}, "We use arrows to show where the body is being pushed or pulled. This is described as the position of the applied force.": {}, "We can also use arrows to show the direction of the applied force.": {}, "Empty Cell": {}}, "Gravitational force": {"Gravity is the reason why things fall towards the centre of the Earth. ": {}, "Here are some examples to show the presence of gravity:": {}, "People who parachute out of planes fall to the ground ": {}, "Things fall off tables onto the floor ": {}, "Balls thrown into the air fall back to the ground": {}, "NaN": {}, "Empty Cell": {}}, "Weight and mass": {"When we talk about the weight of an object, everyone knows that we are talking about how heavy or light the object is. For example, we can make a statement \"The weight of a car is 1500 kilograms\".": {}, "In Science, we use two important words and they are weight and mass. However, these two words do not have the same meaning.": {}, "Weight is the gravitational force pulling the body towards the centre of the Earth. We use springs to measure weight. When you weigh something on the spring scale, give the object a slight pull down and observe the increase in the reading": {}, "Mass is the amount of matter in a body Other words for matter are materials and substances. We usually divide matter into three groups-solids liquids and gases": {}, "Empty Cell": {}}, "Frictional Force": {"Friction is a force that resists any movement of one surface over another. ": {}, "We can experience friction in some everyday events like rubbing our hands together, sliding heavy loads across surfaces and in car and bicycle tyres. When you rub your hands together, they get warm. As one hand slides over the other, there is friction and this creates heat.": {}, "Friction results when one surface slides over another and it is caused by the roughness of the surfaces. Even surfaces that seem smooth can look quite different under a microscope": {}, " If you try to push or pull a heavy box across the floor, you will find it hard to get started. Friction between the bottom surface of the box and the floor makes it hard to move the box.": {}, "However, friction causes certain effects in machines.": {}, "Friction between two surfaces wastes energy, as surfaces sliding over each other results in more energy needed to start the machine and keep it moving": {}, "Friction causes two surfaces that are in contact with each other to get hot": {}, "Friction causes wear and tear between surfaces that are in contact with each other for a while.": {}, "Friction can be reduced by:": {}, "Smooth surfaces": {}, "Lubrication such as oil to keep the surfaces apart": {}, "Rollers or ball bearing between two sliding surfaces": {}, "There are times when we need friction to make things work. For example, tyres on cars and bicycles must grip the road so that the car will not skid, especially when roads are wet and slippery.": {}, "Empty Cell": {}}, "Magnetic Force": {"Magnetism is the attractive or repulsive force that acts between magnetic materials such as iron, steel, cobalt and nickel. It is a force that acts at a distance s caused by a magnetic field. ": {}, "he magnetic field in a bar magnet has two definite poles. Scientists in the earlier periods referred to these poles as the North and South poles.": {}, "The lines of magnetic flux flow from one end of the magnetic object to the other. By convention, we call one end of a magnetic object the N or  North- seeking pole and the other, the S or South-seeking pole, as related to the Earth's north and south magnetic poles": {}, "The magnetic flux is defined os moving from N to 5. A magnetic force is developed between two bar magnets. When the poles are alike, N-N or SS, the magnetic force that develops between them is a repelling force. When the poles are opposite; N-S or S-N, the magnetic force that develops between them is an attracting force.": {}, "Materials that are attracted by a magnet, such as iron, steel, nickel, and cobalt have the ability to become magnetised. These are called magnetic materials. These objects experience a magnetic force when placed in the presence of a magnet. This magnetic force pulls the objects to the magnet.": {}, "Empty Cell": {}}, "Elastic spring force": {"When an object is acted upon by a force, it can be compressed, stretched or bent. If the force is removed and the object returns to its original shape, it is said to be elastic.": {}, "elasticity is the property of an object or material which causes it to be restored to its original shape after distortion. An object is said to be more elastic if it restores itself more precisely to its original shape after distortion.": {}, "Solids that do not return to their original shape once they have been distorted are categorised as non-elastic.": {}, "Empty Cell": {}}}, "Man's impact on his environment": {"Negative impact of Man's activities on his environment": {"Fossil fuels such coal, oil and gas used energy source vehicles factories. They are obtained from under the They were formed remains of living things millions of years ago. Once they are depleted, they cannot be replaced": {}, "Metals and minerals are obtained from the ground to make things such as machines, utensils and jewellery. Once they how been depleted, they cannot be replaced": {}, "Deforestation is the clearing of large areas of forested land by cutting and burning down trees": {}, "Deforestation is carried out to provide land for people to use for farming or building on this is why farming has both positive and negative effects on the environment), allow people to dig up fuels and minerals from the ground and wood which can be used to make paper and furniture": {}, "Pollution is caused by releasing pollutants into the environment. A pollutant is any substance that makes the environment dirty or harmful to live in.": {}, "Pollution can affect the land, air and water bodies such as seas.": {}, "Pollution can be cause by litter, chemicals, CFCs, untreated human waste, smoke, haze and acid rain": {}, "Certain gases in the Earth's atmosphere, such as carbon dioxide, trap heat from the Sun and makes the Earth warm. This warming effect is known as the greenhouse effect, which keeps the Earth from freezing.": {}, "Greenhouse gases such as carbon dioxide are given off as a result of deforestation and the burning of fossil fuels. ": {}, "However, too many greenhouse gases in the atmosphere will lead to the surface of our Earth becoming much warmer as more heat is trapped. This is called global warming.": {}, "The ice around the poles may melt as a result of global warming. The sea level would then rise and places near the sea would be completely flooded": {}, "Empty Cell": {}}, "Positive impact of Man's activities on his environment": {"Man is responsible for protecting his environment. He needs to carry out actions that have a positive impact on his environment. Some of the ways in which this can be done are conservation of natural resources and reforestation.": {}, "We can conserve natural resources by practising the 3Rs - reducing, reusing and recycling": {}, "We need to take measures to reduce land, water and air pollution. Some ways to do this are by disposing of rubbish properly, keeping the environment clean and travelling by public transport instead of by car.": {}, "We need to protect wildlife by conserving natural habitats and preventing overfishing.": {}, "Reforestation should be carried out to reduce the negative effects of deforestation.": {}, "Reforestation involves planting seeds and young plants in forests where trees have been cut down. This will help to restore the forests and the wildlife that lives there.": {}, "Planting new trees will also help reduce the amount of carbon dioxide and global warming": {}, "Empty Cell": {}}}}, "Systems": {"Plant transport system": {"How does the plant transport system work?": {"The water-carrying tubes and food-carrying tubes function concurrently.": {}, "Water-carrying tubes transport water and minerals from the roots, up the stem to the other parts of the plant.": {}, "Food-carrying tubes transport food(sugar) made in the leaves to different parts of the plants. Plants use this sugar to carry out life processes.": {}, "When a stalk of celery is placed in coloured water for some time, the water-carrying tubes transport the coloured water up the stem.": {}, "Empty Cell": {}}}, "Human respiratory system": {"What are the components of air? (Oxygen)": {"Oxygen is essential to all living things.": {}, "Plants and animals take in oxygen from the air to carry out their life processes.": {}, "Oxygen is needed by living things to break down food and use it to obtain energy. This process is known as respiration.": {}, "Living things that live in water take in oxygen dissolved in water.": {}, "Living things that live underground use the oxygen found in the soil.": {}, "Oxygen is produced when plants make their food by a process called photosynthesis.": {}, "Oxygen is needed for burning. WHen an object burns, it combines with the oxygen in the air. A continuous supply of oxygen is needed to keep things burning.": {}, "Empty Cell": {}}, "What are the components of air? (Nitrogen)": {"Nitrogen is the most abundant gas in the air.": {}, "It does not support burning.": {}, "Empty Cell": {}}, "What are the components of air? (Carbon dioxide)": {"Carbon dioxide is given off when living things carry out their life processes.": {}, "Carbon dioxide is also produced when things burn or decay.": {}, "Plants use carbon dioxide to make their food during photosynthesis.": {}, "This exchange of gases happens continuously to maintain a healthy balance of oxygen and carbon dioxide in the air.": {}, "Empty Cell": {}}, "What are the components of air? (Water vapour)": {"The water vapour in the air is an essential link in the water cycle and has a significant effect on the weather. Clouds are formed from water vapour.": {}, "The water vapour returns to Earth as rain, snow or other forms of precipitation.": {}, "The water vapour is produced when water evaporates into air, living things breathe out or when things decay.": {}, "The amount of water vapour in the air varies from place to place. Places near the ocean have more water vapour in the air.": {}, "Empty Cell": {}}, "What are the components of air? (Rare gases)": {"The rare or noble gases present in the air are argon, helium, neon, krypton and xenon.": {}, "Empty Cell": {}}, "What are the main differences between breathing and respiration.": {"Breathing is taking in and giving out air.": {}, "Respiration is the reaction in the cells when oxygen and nutrients are used to produce carbon dioxide and energy.": {}, "Parts of the body involved in breathing: Nose, Mouth, Windpipe, Diaphragm and Lungs.": {}, "The role of oxygen in breathing: Taken is as part of the air breathed in": {}, "Role of carbon dioxide in breathing: Given off as part of the air breathed out.": {}, "Parts of the body involved in Respiration: All living cells of the body": {}, "The role of oxygen in breathing: Used to break down food and release energy": {}, "Role of carbon dioxide in breathing: Produced when food is broken down": {}, "Breathing in is the physical act of taking in air.": {}, "Breathing out is the physical act of giving out air.": {}, "A comparison between the characteristics of air breathed in and out are outlined below": {}, "Breathing in, also known as inhaling, is the process of taking in air for respiration. Inhaled air contains less carbon dioxide (0.03%), more oxygen (20.85%), less water vapour (0.5%) and less heat.": {}, "Breathing out, also known as Exhaling, is the giving out carbon dioxide produced during respiration. Exhaled air contains more carbon dioxide (3.6%), less oxygen (15.3%), more water vapour (6.3%) and more heat.": {}, "Only a fraction of the oxygen inhaled is taken up by the lungs. The composition of water vapour is more in exhaled air compared to inhaled air.": {}, "Empty Cell": {}}, "What are the functions of the organs in the respiratory system?": {"The pathway taken by through the respiratory system in shown.": {}, "Air --> Nose --> Windpipe --> Air Tubes --> Air sacs in lungs": {}, "All the cells in our body require oxygen and we get the oxygen through breathing in the air.": {}, "The human respiratory system consists of the nose, windpipe, air tubes, lungs and air sacs.": {}, "The nose allows air to enter and leave the body. It contains hair and mucus to trap the dirt in the air. The air that passes through is also warmed and moistened.": {}, "The windpipe transfers the air from the nose to the ait tubes.": {}, "Windpipe branches into two smaller air tubes.The Air Tubes transport the air to the lungs.": {}, "The lungs contain air sacs. It allows exchange of gases in the air sacs. It pick up oxygen from inhaled air. It passes the carbon dioxide into the exhaled air.": {}, "The air sacs have a rich supply of blood vessels. This increases the surface area for exchange of gases. Air sacs absorb oxygen. The oxygen passes through the walls of the sacs into the blood vessels. Carbon dioxide passes from the blood vessels into the air sacs.": {}, "The diaphragm is a dome-shaped sheet of muscle that separates the chest cavity from the abdomen. It is the most important muscle use for breathing.": {}, "Empty Cell": {}}, "How do organs in the respiratory system work together? (Breathing In)": {"The ribs move out and upwards.": {}, "The diaphragm moves downwards.": {}, "The chest expands.": {}, "Air rushes into the body through the nose and the mouth.": {}, "Air is cleaned, warmed and moistened in the nose.": {}, "Air moves down the windpipe and sir tubes into the lungs.": {}, "The air tubes branch further and end in balloon-like air sacs that have rich supply of blood vessels.": {}, "When inhaling, the chest cavity enlarges, reducing the pressure outside the lungs. To equalise the pressure, air enters the lungs,": {}, "Empty Cell": {}}, "How do organs in the respiratory system work together? (In the lungs)": {"Oxygen from the air breathed in passes through the walls of the air sacs into the blood vessels.": {}, "Blood carries oxygen to all parts of the body.": {}, "Carbon dioxide passes from the blood vessels into the air sacs.": {}, "Empty Cell": {}}, "How do organs in the respiratory system work together? (Breathing Out)": {"The ribs move in and downwards.": {}, "The diaphragm moved upwards.": {}, "The chest becomes smaller. ": {}, "Air is forced out of the lungs by the chest muscles.": {}, "NaN": {}, "Empty Cell": {}}, "How do animals and plants exchange gases with their surroundings?": {"The respiratory system is responsible for the exchange of gases of living with their surroundings.": {}, "DIfferent organisms have different parts that make up their respiratory system. The table below summarises how living things exchange with their surroundings.": {}, "Insects and arachnids have openings that lead to tubes which carry oxygen to their internal organs.": {}, "Fish take in oxygen through their gills. Water contained dissolved oxygen enters the mouth of the fish. It washes over the gills and the oxygen enters the blood in the gills.As water flows out from under the gill covers, carbon dioxide from the blood is carried away.": {}, "Birds has lungs and they take in air through their nostrils.": {}, "Mammals haves lungs and they take in air through their nostrils. Some mammals such as whales and dolphins also have lungs but they breathe through blowholes on tap of their heads.": {}, "Amphibians use lungs and skin to breathe. Some amphibians such as salamander take in oxygen through their gills. Frogs can breathe through their moist skin. When they are underwater, they sue moist skin to breathe instead of their lungs.": {}, "Plants have tiny openings, mostly found on the underside of the leaf, called stomata. THey sue there stomata for their gaseous exchange. During respiration through the day, plants take in oxygen and produces carbon dioxide. Stomata are commonly found on the underside of leaves, away from direct sunlight to prevent water from evaporating.": {}, "Empty Cell": {}}}, "Human circulatory system": {"What are the parts of the circulatory system? (Heart)": {"The heart is a muscular organ situated near the middle part of our chest. It is slightly tilted to the left side of the body and is protected by the ribcage.": {}, "It is a vital organ that pumps blood all the time, to all parts of our body.": {}, "The heart is made of special muscles called heart muscles.": {}, "We cannot control the movements of the heart muscles, though we can control other muscles such as these in the arms and legs.": {}, "Each heartbeat is a cycle of contraction and relaxation of the heart muscles.": {}, "The average rate of heartbeat of a healthy person is about 60 to 70 times per minute.": {}, "The rate of heartbeat changes with age, health and type of activity the person is doing.": {}, "With each heartbeat, a pressure wave passes along the blood vessels, pushing blood through them. This is known as the pulse.": {}, "We take our pulse by pressing out fingers on our wrist or neck, and counting the number of pulses felt per minute.": {}, "The normal pulse rate of a healthy young adult is about 60 to 70 times per minute. This is measured when the person is at rest.": {}, "The faster the heart beats, the higher the pulse rate.": {}, "When we exercise, our heart rate increases.": {}, "The body requires a greater supply of digested food and oxygen that is carried in the blood to the various parts of the body. The blood also rapidly removes the carbon dioxide produced. Hence, the heart has to pump blood faster around the body.": {}, "The digested food and oxygen is used for respiration in order to release enough energy for the activity that is taking place.": {}, "Empty Cell": {}}, "What are the parts of the circulatory system? (Blood Vessels)": {"Blood vessels are tubes through which blood flows.": {}, "A network of blood vessels connected to the heart to all parts of our body.": {}, "Other blood vessels carry blood from other parts of our body back to the heart.": {}, "Empty Cell": {}}, "What are the parts of the circulatory system? (Blood)": {"Blood transports digested food, oxygen, water, carbon dioxide and other waste materials to different parts of the body.": {}, "Digested food, oxygen and water are transported to the cell of the body while carbon dioxide and other waste materials are transported away from the cells to the organs that get rid of waste materials, such as the lungs, kidney and skin.": {}, "Blood flows through the blood vessels to get to different parts of our body,": {}, "Empty Cell": {}}, "How do the organs in the circulatory system work together? (Functions of the Blood Circulatory System)": {"Transport oxygen, digested food and water to all parts of the body.": {}, "Carry carbon dioxide and waste materials away from different parts of the body to be released.": {}, "The heart pumps oxygen-rich blood to all parts of the body, through the arteries.": {}, "Blood also carries digested food and water from the digestive system to all parts of the body.": {}, "The arteries branch into fine capillaries.": {}, "The digested food, oxygen and water pass through the thin walls of the capillaries into the cells of the body.": {}, "The cells use digested food, oxygen and water to produce energy. In the process, carbon dioxide and other waste materials are also produced.": {}, "Carbon dioxide and waste materials pass from the cells of the body into capillaries.": {}, "The capillaries merge to form veins.": {}, "The veins transport waste materials to the organs that can remove them from the body, such as kidneys.": {}, "Carbon dioxide-rich blood is returned to the heart and sent to the lungs.": {}, "Empty Cell": {}}, "How do the other organ systems works together with the Circulatory System?": {"Body systems cannot work alone. They are interconnected with one another.": {}, "Some organs could be part of several systems.": {}, "The following points shows how the circulatory system is interconnected with the respiratory, digestive and muscular system.": {}, "Circulatory and Respiratory system: It provides oxygen for the organs. Oxygen is carried by red blood cells to all parts of the body. It also removes carbon dioxide and water that the heart cells produce.": {}, "Circulatory and Digestive system: It provides the heart and other organs in the circulatory system with nutrients so that the heart can keep beating.": {}, "Circulatory and Muscular system: The heart muscles pump blood continuously to all parts of the body. SMooth muscles located in veins and arteries push blood through them with each heartbeat.": {}, "Empty Cell": {}}, "What are the differences between the transport systems in animals and plants?": {"The functions of the circulatory system in animals is to transport materials through the body of the animal but the functions of the circulatory system in animals is to transport materials throughout the body of the plant and to support the plant.": {}, "Materials transported by the circulatory system in animals is oxygen carbon dioxide, digested food and water while the materials transported by the transport system in plants is water and minerals from roots, food from leaves.": {}, "Liquid flowing in the circulatory system in animals is blood while in plants is sap.": {}, "Tubes through which liquid flows in animals is arteries, veins and capillaries while implants it is water-carrying tubes(xylem) and food-carrying tubes(phloem).": {}, "Organs that pumps the liquid through the tubes in animals is the heart while there is none in plants.": {}, "Empty Cell": {}}}, "Cell system": {"Microscope": {"The function of a microscope is to help us see objects that are too small to be seen with the naked eye.": {}, "The common light microscope uses a system of lenses to magnify the specimen. The specimen is the object we would like to see.": {}, "Empty Cell": {}}, "What are the different parts of animal and plant cells?": {"An animal cell has a nucleus, cytoplasm and cell membrane.": {}, "An animal cell has no chloroplasts and cell wall.": {}, "A plant cell has a nucleus, cytoplasm, cell membrane, chloroplasts and cell wall.": {}, "Empty Cell": {}}, "What are the functions of the different parts of a cell?": {"Cytoplasm is present in both the animal and plant cell. The cytoplasm is a jelly-like substance that contains manny cell parts. The cytoplasm allow substances to move around within the cell.": {}, "Nucleus is present in both the animal and plant cell. Nucleus is a round or oval cell part inside the cytoplasm. THe nucleus controls everything that happens inside the cell. It also contains information that is passed on from one generation to another.": {}, "Cell membrane is present in both the animal and plant cell. The cell membrane is a thin layer that surrounds the cytoplasm. The cell membrane controls the movement of materials doing into and out of the cell.": {}, "Cell wall is absent in the animal cell but it present in the plant cell. The cell wall is a stiff layer around the cell membrane. It supports and give the plant cell its shape.": {}, "Chloroplast in absent in the animal cell but in present in the plant cell. The chloroplast is a tiny disc-like cell part that contains a green pigment called chlorophyll. It captures sunlight for plant to make food.": {}, "Empty Cell": {}}}, "Electrical system": {"What is a simple electric system made up of?": {"An electric circuit is an electrical system": {}, "It is made up of a number of components, including a energy source (For example a battery), wires, bulb and a switch.": {}, "Empty Cell": {}}, "What is a simple electric system made up of? ( Battery )": {"A battery has a positive pole and a negative pole": {}, "When the two poles of the battery are connected in a closed electric circuit, electricity flows through the circuit": {}, "Batteries are convenient sources of electricity. They are use in small electrical appliances that can be carried around easily, such as cameras, calculators and mobile phones": {}, "Batteries come in different shapes and sizes.": {}, "Empty Cell": {}}, "What is a simple electric system made up of? ( Wires )": {"Electric current normally flows through wires": {}, "Wires are generally made of copper. Copper allows electric current to pass through easily": {}, "Empty Cell": {}}, "What is a simple electric system made up of? ( Switch )": {"A switch is used to control the flow of electric current in a circuit.": {}, "A switch either breaks or completes an electric circuit.": {}, "When the switch is open, there is a gap or break in the electric circuit, Electric current cannot flow through the gap in the circuit.": {}, "When the switch is closed, electric current can flow through the switch, and the circuit is complete.": {}, "Empty Cell": {}}, "What is a simple electric system made up of? (Bulb)": {"A bulb is an electric device that is often used in a circuit.": {}, "It consists of a glass bulb, filament, wire, metal casing and metal tip.": {}, "The glass bulb prevents the filament from being damaged.": {}, "The filament preduces light and heat when electric current pases through.": {}, "The wire connects filaments to metal tip and metal casing.": {}, "The metal casing is connected to other components of the electric circuit.": {}, "The metal tip connected the other components of the electric circuit.": {}, "A bulb shines when its filament becomes very hot and begins to give off light.": {}, "The filament of a bulb is usually made of tungsten.": {}, "Empty Cell": {}}, "How does electric current flow in a circuit? (Types of circuits)": {"Closed and open circuits": {}, "Series and parallel circuits": {}, "Empty Cell": {}}, "How does electric current flow in a circuit? (Closed circuit)": {"An electric current can only flow in a closed or complete circuit.": {}, "When the components of the circuit are joined to form a complete path for electric current to flow through, the circuit is called a closed circuit": {}, "In a closed circuit, electric current flows from the battery, through the wires to other electrical components(s) and back into the battery": {}, "A circuit can only be complete when all the components are properly connected": {}, "Empty Cell": {}}, "How does electric current flow in a circuit? (Open circuit)": {"When the components of a circuit are not properly connected, there may be a break. or a gap in the circuit": {}, "When that happens, electric current cannot pass through the gap. The path that the electric current flows through is broken and the circuit is a open circuit": {}, "A switch can be used to close or open a circuit": {}, "Empty Cell": {}}, "How does electric current flow in a circuit? (Connections in a bulb)": {"A bulb will light up when we use wires to connect it properly to a working battery": {}, "There are two ways to connect a bulb to a battery": {}, "When the metal tip and the metal casing of the bulb are connected to different poles of the battery, the bulb lights up": {}, "This is because there is a complete circuit for electric current to flow between the poles of the battery": {}, "The bulb will now light up id either the metal the metal tip or the metal casing is not connected to the battery or the bulb blows": {}, "Empty Cell": {}}, "How does electric current flow in a circuit? (Series and parallel circuits)": {"A series circuit is a circuit with only one path for electric current to flow through": {}, "If two bulbs are connected in a series and one of the bulbs is either removed or had blown, the circuit will not work. This is because the circuit is open": {}, "An example of a series circuit is a string of Christmas lights. If any of the bulbs is missing or has blown, electric current will not flow and none of the lights within the series will work.": {}, "A parallel circuit has more than one path for electric current to flow through": {}, "If two bulbs are connected in parallel, one bulb will work when the other is removed or has blown": {}, "An example of a parallel circuit is the wiring system of a house, If one of the lights blows out, electric current can still flow to the rest of the lights and appliances": {}, "Empty Cell": {}}, "What are electric conductors and insulators?": {"Some materials allow electric current to flow through them , while others do not .": {}, "These properties of materials have to be taken into consideration when choosing materials for making electrical appliances , devices and cables .": {}, "Empty Cell": {}}, "What are electric conductors and insulators? (Electrical conductors)": {"Materials that allow electric current to flow through them are called conductors of electricity or electrical conductors .": {}, "Some electrical conductors conduct electricity better than others . Materials that allow electric current to pass through them easily are called good conductors of electricity": {}, "Most metals are good conductors of electricity. Examples are gols, silver and copper": {}, "Silver is a better electrical conductor than copper. However, copper is usually used in current-carrying wires because copper is cheaper than silver": {}, "Some liquids also conduct electricity. Some examples are salt solution and mercury": {}, "Mercury is a metal that is liquid at room temperature": {}, "Electrical conductors are generally good conductors of heat. Some examples are most metals": {}, "Empty Cell": {}}, "What are electric conductors and insulators? (Electrical insulators)": {"Materials that do not allow electricity to flow through them are called non-conductors of electricity of electrical insulators": {}, "Most non-metals are electrical insulators. Some examples are glass, air, plastic, wood, clay, cloth, paper and cotton": {}, "Most electrical appliances are cased in insulators to prevent electrical shocks. Wires are also covered in plastic or rubber for the same purpose. Materials used for insulation purposes are called insulation.": {}, "Empty Cell": {}}, "What are electric conductors and insulators? (Circuit tester)": {"A circuit tester is used to distinguish between electrical conductors and insulators": {}, "A circuit is a simple electric circuit with a bulb. However, it is an open circuit rather than a closed one": {}, "To test whether a material is a conductor or an insulator, we connect an object made of that material to the circuit": {}, "When an electrical conductor is connected to the circuit, the bulb lights up. This is because the abject closes the gap by allowing electric to flow through it": {}, "When an electrical insulator ic connected to the circuit, the bulb doesn't light up. This is because electric current cannot flow through the electrical insulator, so the circuit remains open": {}, "Empty Cell": {}}}, "Using electricity": {"What are some variables that can affect the electric current in a circuit?": {"The brightness of the bulb depends on the arrangement of batteries, the number of batteries, the number of bulbs and the arrangement of bulbs.": {}, "Empty Cell": {}}, "Arrangement of Batteries": {"Tha batteries in a circuit may be connected in series or parallel": {}, "Empty Cell": {}}, "Batteries in series": {"When the positive pole of a battery is connected to negative pole of another battery, the batteries are connected in series. This arrangement is commonly used in a torch and a radio": {}, "Empty Cell": {}}, "Number of batteries": {"When more batteries are connected in series, the bulbs in the circuit shine more brightly. This is because more batteries in series provide more power to the circuit, and more electric current flows through each bulb.": {}, "However, when too many batteries are connected in series to a bulb, the amount of current flowing through the filament may cause the filament to overheat and melt. As a result, the bulb will blow.": {}, "Empty Cell": {}}, "Number of bulbs": {"When more bulbs are added to a circuit, the individual bulbs in the circuit shine less brightly. This is because the amount of electric current flowing through each bulb is decreased.": {}, "When one of the bulbs connected in series blows, the other bulb will also not light up, because there is a break in the circuit.": {}, "Empty Cell": {}}, "Arrangement of Bulbs (Bulbs in parallel)": {"When bulbs are. arranges in parallel, there are many separate parts through which the current can flow.": {}, "When more bulbs are added in parallel to the circuit, the individual bulbs in the circuit shine as brightly as before. This is because the electric current flowing through each bulb is still the same, no matter how many bulbs tere are in parallel": {}, "Electrical appliances in homes are usually connected in parallel. When one electrical appliance is faulty, electrical current can still flow to other appliances. THerefore, the other appliances can still work.": {}, "Empty Cell": {}}, "Why should we use electricity safely?": {"Electricity can be dangerous. Electricity can cause fire and give us electrical shocks.": {}, "Most of the appliances around us run on electricity. It is important that we know how to use electricity and electrical appliances properly": {}, "Common causes of electrical accidents include handling appliances with wet hands, handling appliances that have damages insulation or overloading power points by plugging in too many electrical appliances at the same time": {}, "Not connecting too many appliances to one socket, making sure wires are not exposed, not touching switches with wet hands, using breakers and fuses and not repairing electrical equipment yourself are ways to use electricity safely": {}, "Empty Cell": {}}, "How can we use electricity wisely?": {"We should conserve electricity so that natural resources such as coal, oil and natural gas can last longer.": {}, "Electricity is usually produced using natural resources, which are materials that we get from earth. Once they are used up, they cannot be replaced quickly.": {}, "The faster we use these natural resources, the faster they run out. WHen we waste electricity, we indirectly waste these natural resources.": {}, "We pay for electricity. By conserving electricity, we also save money": {}, "We can conserve electricity by turning off all electrical appliances when they are not in use. Use appliances that will turn off automatically when they are not in use or have power-saving features. Use energy-saving light bulbs. They use less electricity but are bright as filament bulbs. Sleeping with lights off or using a small lamp if there is a need to have light on. Not leaving the refrigerator door open for long periods of time. THis is because the air in the refrigerator will become warm if the door is left open. A lot of energy will have to be used to cool the refrigerator again. Using a fan instead of a air-conditioner.": {}, "Empty Cell": {}}}}}}
